[
    {
        "gameCode": "PUBG",
        "img": "img/gameIcon/PUBG.jpeg",
        "title": "Player Unknown's Battlegrounds",
        "genre": "Battle Royal",
        "about": "This game was inspired by the Japanese film Battle Royale where the last player standing wins. PUBG became famous because 100 players are parachuted onto an island, and they have to fight each other until one person is left. This game lets you play with your friends and mess around with them; however, remember that survival is the priority!  Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "PUBG Corporation",
        "rating": 8,
        "tournament": "YES",
        "price": 60,
        "bought": 42,
        "wallpaper": "img/gameWallpaper/PUBG.jpg",
        "video": "video/gameTrailer/PUBG.mp4",
        "SS1": "img/gameSS/PUBG/SS1.jpg",
        "SS2": "img/gameSS/PUBG/SS2.png",
        "SS3": "img/gameSS/PUBG/SS3.jpg",
        "SS4": "img/gameSS/PUBG/SS4.jpg"
    },
    {
        "gameCode": "AXLS",
        "img": "img/gameIcon/AL.jpeg",
        "title": "Apex Legends",
        "genre": "Battle Royal",
        "about": "This game has been making a lot of storms. This is the game for those who prefer battlefield games but don't play PUBG or Fortnite. Three players from each squad are left on the island to scavenge for extra supplies and weapons to combat other teams. The squad with the most members will be victorious. This map games and ping communication method should be used from here on out.  Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Respawn Entertainment",
        "rating": 9,
        "tournament": "YES",
        "price": 0,
        "bought": 25,
        "wallpaper": "img/gameWallpaper/AL.png",
        "video": "video/gameTrailer/Apex Legends.mp4",
        "SS1": "img/gameSS/AL/SS1.jpg",
        "SS2": "img/gameSS/AL/SS2.jpg",
        "SS3": "img/gameSS/AL/SS3.jpg",
        "SS4": "img/gameSS/AL/SS4.jpg"
    },
    {
        "gameCode": "FBR",
        "img": "img/gameIcon/Fortnite.jpg",
        "title": "Fortnite Battle Royale",
        "genre": "Battle Royal",
        "about": "Fortnite is the most popular online game. This game is a hybrid of Minecraft, PUBG, and Call of Duty, and it's a lot of fun! This game is great if you enjoy being creative. In this survival game, you must defend yourself against zombies, construct structures, and battle other players. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Epic Games",
        "rating": 8,
        "tournament": "YES",
        "price": 0,
        "bought": 350,
        "wallpaper": "img/gameWallpaper/Fortnite.jpg",
        "video": "video/gameTrailer/Fortnite.mp4",
        "SS1": "img/gameSS/Fortnite/SS1.png",
        "SS2": "img/gameSS/Fortnite/SS2.jpg",
        "SS3": "img/gameSS/Fortnite/SS3.jpg",
        "SS4": "img/gameSS/Fortnite/SS4.png"
    },
    {
        "gameCode": "CSGO",
        "img": "img/gameIcon/CSGO.jpg",
        "title": "Counter-Strike: Global Offensive",
        "genre": "Tactical shooter",
        "about": "This is a very popular and successful shooting game. You are a Counter-Terrorist or Terrorist tasked with preventing other players from winning. You could play this game in various modes, such as deathmatch, defuse, hostage rescue, bomb mode, and so on. There are numerous maps to explore, as well as numerous weapons to employ!  Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Valve",
        "rating": 10,
        "tournament": "YES",
        "price": 0,
        "bought": 25,
        "wallpaper": "img/gameWallpaper/CSGO.png",
        "video": "video/gameTrailer/Counter-Strike- Global Offensive.mp4",
        "SS1": "img/gameSS/CSGO/SS1.jpg",
        "SS2": "img/gameSS/CSGO/SS2.png",
        "SS3": "img/gameSS/CSGO/SS3.png",
        "SS4": "img/gameSS/CSGO/SS4.png"
    },
    {
        "gameCode": "VALO",
        "img": "img/gameIcon/Valorant.jpg",
        "title": "Valorant",
        "genre": "Tactical shooter",
        "about": "Valorant is a team-based first-person tactical hero shooter set in the near future. Players play as one of a set of Agents, characters based on several countries and cultures around the world. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Roit Games",
        "rating": 7,
        "tournament": "YES",
        "price": 0,
        "bought": 20,
        "wallpaper": "img/gameWallpaper/Valorant.jpg",
        "video": "video/gameTrailer/VALORANT.mp4",
        "SS1": "img/gameSS/VALO/SS1.jpg",
        "SS2": "img/gameSS/VALO/SS2.jpg",
        "SS3": "img/gameSS/VALO/SS3.jpg",
        "SS4": "img/gameSS/VALO/SS4.jpg"
    },
    {
        "gameCode": "OW",
        "img": "img/gameIcon/Overwatch.jpg",
        "title": "Overwatch",
        "genre": "Tactical shooter",
        "about": "Overwatch 2 is a free-to-play, always-on, and ever-evolving live game. Team up with friends regardless of platform and jump into the reimagined PvP experience.  Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Microsoft",
        "rating": 6,
        "tournament": "YES",
        "price": 0,
        "bought": 50,
        "wallpaper": "img/gameWallpaper/oW.jpg",
        "video": "video/gameTrailer/Overwatch.mp4",
        "SS1": "img/gameSS/OW/SS1.jpg",
        "SS2": "img/gameSS/OW/SS2.jpg",
        "SS3": "img/gameSS/OW/SS3.jpg",
        "SS4": "img/gameSS/OW/SS4.jpg"
    },
    {
        "gameCode": "RDR2",
        "img": "img/gameIcon/RDR2.jpg",
        "title": "Red Dead Redemption 2",
        "genre": "Open World",
        "about": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Rockstar Games",
        "rating": 10,
        "tournament": "NO",
        "price": 60,
        "bought": 59,
        "wallpaper": "img/gameWallpaper/RDR2.png",
        "video": "video/gameTrailer/Red Dead Redemption 2.mp4",
        "SS1": "img/gameSS/RDR2/SS1.jpg",
        "SS2": "img/gameSS/RDR2/SS2.jpg",
        "SS3": "img/gameSS/RDR2/SS3.jpg",
        "SS4": "img/gameSS/RDR2/SS4.jpg"
    },
    {
        "gameCode": "AC1",
        "img": "img/gameIcon/AC1.jpg",
        "title": "Assassing's Creed 1",
        "genre": "Open World",
        "about": "Assassin's Creed is a historical action-adventure video game series and media franchise published by Ubisoft and developed mainly by its studio Ubisoft Montreal using the game engine Anvil and its more advanced derivatives. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Ubisoft",
        "rating": "8",
        "tournament": "NO",
        "price": "40",
        "bought": "38",
        "wallpaper": "AC1.jpg",
        "video": "video/gameTrailer/Assassin's Creed.mp4",
        "SS1": "img/gameSS/AC1/SS1.jpeg",
        "SS2": "img/gameSS/AC1/SS2.jpg",
        "SS3": "img/gameSS/AC1/SS3.jpg",
        "SS4": "img/gameSS/AC1/SS4.jpg"
    },
    {
        "gameCode": "FH5",
        "img": "img/gameIcon/FH5.jpg",
        "title": "Forza Horizon 5",
        "genre": "Racing",
        "about": "Forza Horizon 5 is a 2021 racing video game developed by Playground Games and published by Xbox Game Studios. It is the fifth Forza Horizon title and twelfth main instalment in the Forza series. The game is set in a fictionalised representation of Mexico. It was released on 9 November 2021 for Windows, Xbox One, and Xbox Series X/S. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Playground Games",
        "rating": 7,
        "tournament": "YES",
        "price": 60,
        "bought": 90,
        "wallpaper": "img/gameWallpaper/FH5.jpg",
        "video": "video/gameTrailer/Forza Horizon 5.mp4",
        "SS1": "img/gameSS/FH5/SS1.jpg",
        "SS2": "img/gameSS/FH5/SS2.jpg",
        "SS3": "img/gameSS/FH5/SS3.jpg",
        "SS4": "img/gameSS/FH5/SS4.jpg"
    },
    {
        "gameCode": "ACM",
        "img": "img/gameIcon/ACM.jpeg",
        "title": "Assassing's Creed Mirage",
        "genre": "Open World",
        "about": "Assassin's Creed Mirage is a 2023 action-adventure game developed by Ubisoft Bordeaux and published by Ubisoft. The game is the thirteenth major installment in the Assassin's Creed series and the successor to 2020's Assassin's Creed Valhalla. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Ubisoft",
        "rating": 7,
        "tournament": "NO",
        "price": 70,
        "bought": 40,
        "wallpaper": "img/gameWallpaper/ACM.jpg",
        "video": "video/gameTrailer/Assassin's Creed Mirage.mp4",
        "SS1": "img/gameSS/ASM/SS1.jpg",
        "SS2": "img/gameSS/ASM/SS2.jpg",
        "SS3": "img/gameSS/ASM/SS3.jpg",
        "SS4": "img/gameSS/ASM/SS4.jpg"
    },
    {
        "gameCode": "GOWR",
        "img": "img/gameIcon/GOWR.jpeg",
        "title": "God of War Ragnorök",
        "genre": "Hack and Slash",
        "about": "God of War Ragnarök is an action-adventure game developed by Santa Monica Studio and published by Sony Interactive Entertainment. It was released worldwide on November 9, 2022, for both the PlayStation 4 and PlayStation 5, marking the first cross-gen release in the God of War series. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Santa Monica Studio",
        "rating": 10,
        "tournament": "NO",
        "price": 80,
        "bought": 90,
        "wallpaper": "img/gameWallpaper/GOWR.jpeg",
        "video": "video/gameTrailer/God of War Ragnarök.mp4",
        "SS1": "img/gameSS/GOWR/SS1.jpg",
        "SS2": "img/gameSS/GOWR/SS2.jpg",
        "SS3": "img/gameSS/GOWR/SS3.jpg",
        "SS4": "img/gameSS/GOWR/SS4.jpeg"
    },
    {
        "gameCode": "GT7",
        "img": "img/gameIcon/GT7.jpeg",
        "title": "Gran Turismo 7",
        "genre": "Racing",
        "about": "Gran Turismo 7 is a 2022 racing simulation video game developed by Polyphony Digital and published by Sony Interactive Entertainment. The game is the eighth main installment and the thirteenth overall in the Gran Turismo series. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Polyphony Digital",
        "rating": 9,
        "tournament": "YES",
        "price": 70,
        "bought": 60,
        "wallpaper": "img/gameWallpaper/GT7.jpg",
        "video": "video/gameTrailer/Gran Turismo 7.mp4",
        "SS1": "img/gameSS/GT7/SS1.jpg",
        "SS2": "img/gameSS/GT7/SS2.jpeg",
        "SS3": "img/gameSS/GT7/SS3.jpg",
        "SS4": "img/gameSS/GT7/SS4.jpeg"
    },
    {
        "gameCode": "HB2",
        "img": "img/gameIcon/HB2.jpg",
        "title": "Senua's Saga: Hellblade II",
        "genre": "Hack and Slash",
        "about": "Senua's Saga: Hellblade II is an upcoming action-adventure game developed by Ninja Theory and published by Xbox Game Studios. The game is the sequel to Hellblade: Senua's Sacrifice. It is scheduled to release for Windows and Xbox Series X/S on 21 May 2024. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Ninja Theory",
        "rating": 8,
        "tournament": "NO",
        "price": 80,
        "bought": 0,
        "wallpaper": "img/gameWallpaper/HB2.jpeg",
        "video": "video/gameTrailer/HELLBLADE 2.mp4",
        "SS1": "img/gameSS/HB2/SS1.jpeg",
        "SS2": "img/gameSS/HB2/SS2.jpeg",
        "SS3": "img/gameSS/HB2/SS3.jpg",
        "SS4": "img/gameSS/HB2/SS4.jpg"
    },
    {
        "gameCode": "HFW",
        "img": "img/gameIcon/HFW.jpg",
        "title": "Horizon Forbidden West",
        "genre": "Open World",
        "about": "Horizon Forbidden West is a 2022 action role-playing game developed by Guerrilla Games and published by Sony Interactive Entertainment. The sequel to Horizon Zero Dawn (2017), the game is set in a post-apocalyptic version of the Western United States recovering from the aftermath of an extinction event caused by a rogue robot swarm. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Guerrilla Games",
        "rating": 6,
        "tournament": "NO",
        "price": 60,
        "bought": 41,
        "wallpaper": "img/gameWallpaper/HFW.jpg",
        "video": "video/gameTrailer/Horizon Forbidden West.mp4",
        "SS1": "img/gameSS/HFW/SS1.jpg",
        "SS2": "img/gameSS/HFW/SS2.jpg",
        "SS3": "img/gameSS/HFW/SS3.jpg",
        "SS4": "img/gameSS/HFW/SS4.jpg"
    },
    {
        "gameCode": "SM2",
        "img": "img/gameIcon/SM2.jpeg",
        "title": "Spider-Man 2",
        "genre": "Open World",
        "about": "Marvel's Spider-Man 2 is a 2023 action-adventure game developed by Insomniac Games and published by Sony Interactive Entertainment. It is based on the Marvel Comics character Spider-Man, and features a narrative inspired by its long-running comic book mythology which is also derived from various adaptations in other media. Before the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as Legends. The game has two gameplay modes. In Battle Royale, up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In Arenas, players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.",
        "company": "Insomniac Games",
        "rating": 9,
        "tournament": "NO",
        "price": 70,
        "bought": 100,
        "wallpaper": "img/gameWallpaper/SM2.jpeg",
        "video": "video/gameTrailer/Spider-Man 2.mp4",
        "SS1": "img/gameSS/SM2/SS1.jpeg",
        "SS2": "img/gameSS/SM2/SS2.jpg",
        "SS3": "img/gameSS/SM2/SS3.jpeg",
        "SS4": "img/gameSS/SM2/SS4.jpg"
    },
    {
        "gameCode": "GTA6",
        "img": "img/gameIcon/GTA6.jpg",
        "title": "Grand Theft Auto VI",
        "genre": "Open World",
        "about": "Grand Theft Auto VI is an upcoming action-adventure game in development by Rockstar Games. It is due to be the eighth main Grand Theft Auto game, following Grand Theft Auto V (2013), and the sixteenth entry overall. Set within the fictional open world state of Leonida—based on Florida—and its Miami-inspired Vice City, the story is expected to follow the criminal duo of Lucia and her male partner.",
        "company": "Rockstar Games",
        "rating": 10,
        "tournament": "NO",
        "price": 90,
        "bought": 0,
        "wallpaper": "img/gameWallpaper/GTA6.jpg",
        "video": "video/gameTrailer/Grand Theft Auto VI.mp4",
        "SS1": "img/gameSS/GTA6/SS1.jpg",
        "SS2": "img/gameSS/GTA6/SS2.jpg",
        "SS3": "img/gameSS/GTA6/SS3.jpg",
        "SS4": "img/gameSS/GTA6/SS4.jpg"
    }
]